hotRoom6G_ABL_WTBMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       57705;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       58705;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       59705;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       60105;
    }
    side01
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1000;
        startFace       60505;
    }
    side02
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1000;
        startFace       61505;
    }
    box
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       62505;
    }
)

// ************************************************************************* //
